Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/council_of_state.html.txt.tmx
Source language: en
Languages: ga

source: The Council of State is an advisory body that aids and counsels the President
ga: Údarás comhairle í an Chomhairle Stáit a chuireann cúnamh agus comhairle ar fáil don Uachtarán

source: Before the President can exercise some of their functions, they must consult with the Council of State
ga: Ní mór don Uachtarán dul i gcomhairle leis an gComhairle Stáit roimh dó/dí cuid de na feidhmeanna, atá aige/aici a chur i gcrích

source: The President must consult with the Council of State before they can convene a meeting of one or both Houses of the Oireachtas
ga: Ní mór don Uachtarán comhairle a ghlacadh ón gComhairle Stáit roimh dó/dí cruinniú de cheachtar nó de dhá Theach an Oireachtais a thionól

source: The President must also consult with the Council of State in order to exercise some of their powers in relation to legislation
ga: Ní mór don Uachtarán freisin dul i gcomhairle leis an gComhairle Stáit maidir le cuid dá c(h)umhachtaí a bhaineann le reachtaíocht a chur i gcrích

source: The Council of State was established under Article 31 of Bunreacht na hEireann (the Constitution)
ga: Bunadh an Chomhairle Stáit faoi alt 31 Bunreacht na hÉireann

source: There are 3 categories of members of the Council of State:
ga: Tá trí rannóg daoine gur féidir leo a bheith ina mbaill den Chomhairle Stáit:

source: • Ex- officio members are those who are members by virtue of their office
ga: • De bhua oifige atá na daoine seo ina mbaill

source: These include the Taoiseach, the Tanáiste, the Chief Justice, the President of the High Court, the Ceann Comhairle of the Dáil, the Cathaoirleach of the Seanad and the Attorney General
ga: Ina measc tá an Taoiseach, an Tánaiste , an Príomh-Bhreitheamh, Uachtarán na hArd-Chúirte, Ceann Comhairle Dháil Éireann, Cathaoirleach Sheanad Éireann agus an tArd-Aighne

source: These include every former President, Taoiseach and Chief Justice who is able and willing to act
ga: Ina measc Iar Uachtaráin, Iar Thaoisigh agus Iar Phríomh-Bhreithimh a bhfuil sé ar a gcumas agus ar fonn leo gníomhú

source: • Members appointed by the President
ga: • Baill ceapaithe ag an Uachtarán

source: The President can appoint up to 7 members whose term on the Council only lasts as long as the President is in office
ga: Is féidir leis an Uachtarán suas le seachtar a cheapadh agus maireann a dtréimhse ar an gComhairle chomh fada agus a mhaireann téarma oifige an Uachtaráin sin

source: If the President has sufficient reason, he or she can terminate the appointment of any of these members
ga: Má tá fáth réasúnta ag an Uachtarán, is féidir leis/léi deireadh a chur le ceapachán na mball sin
